brew 'trash'
brew 'watch' # watch command output
brew 'bat'
# brew 'fdclone' # file manager
brew 'yank' # copy to clipboard
brew 'lnav' # log files viewer
brew 'glances'
brew 'cmus'
brew 'gnu-sed' # dependency of https://github.com/oh-my-fish/theme-budspencer
brew 'nnn' # cli file manager
brew 'mediainfo' # nnn dependency
brew 'ffmpeg'
brew 'libav', args: ['with-openssl']
brew 'highlight'
brew 'luarocks'
brew 'fish'
brew 'eg-examples'
brew 'm-cli'
brew 'neovim'
brew 'grc'
brew 'ccat'
brew 'thefuck'
brew 'fzf'
brew 'fd'
brew 'jq'
brew 'exa'
brew 'tree'
brew 'gron'
brew 'heroku/brew/heroku'
brew 'cheat'
brew 'wget'
brew 'mas'
brew 'terminal-notifier' # used for `fisher add franciscolourenco/done`
brew 'peco'
brew 'nano'
brew 'yarn'
brew 'prettyping'
brew 'htop'

# tap cjbassi/gotop
# brew gotop

brew 'psgrep'
brew 'iftop'  # network monitoring tool
brew 'ncdu' # disk usage
brew 'gnu-tar' # for doom-emacs
brew 'httpie' # http client
brew 'colordiff' # diff tool with syntax highlight `colordiff a.js b.js --side-by-side`
# brew 'mitmproxy'
