edc/bass
danhper/fish-fastdir
brgmnn/fish-docker-compose
barnybug/docker-fish-completion
fisherman/await
fisherman/fzf
fisherman/get
fisherman/getopts
fisherman/grc
fisherman/last_job_id
oh-my-fish/plugin-thefuck
