edc/bass
danhper/fish-fastdir
decors/fish-colored-man
brgmnn/fish-docker-compose
barnybug/docker-fish-completion
fisherman/await
fisherman/fzf
fisherman/get
fisherman/getopts
fisherman/last_job_id
brigand/fast-nvm-fish
