danhper/fish-fastdir
decors/fish-colored-man
jethrokuan/fzf
edc/bass
brgmnn/fish-docker-compose
barnybug/docker-fish-completion
franciscolourenco/done
oh-my-fish/plugin-grc
oh-my-fish/plugin-node-binpath
markcial/upto
laughedelic/brew-completions
oh-my-fish/plugin-pj
# shinriyo/breeze
jorgebucaran/fish-nvm
