danhper/fish-fastdir
decors/fish-colored-man
franciscolourenco/done
jethrokuan/fzf
jorgebucaran/fisher
jorgebucaran/autopair.fish
markcial/upto
oh-my-fish/plugin-node-binpath
oh-my-fish/plugin-pj
edc/bass
paysonwallach/fish-you-should-use
lengyijun/fc-fish
brewingweasel/fishbang
fabioantunes/fish-nvm
