barnybug/docker-fish-completion
brgmnn/fish-docker-compose
danhper/fish-fastdir
decors/fish-colored-man
franciscolourenco/done
jethrokuan/fzf
jorgebucaran/fisher
jorgebucaran/autopair.fish
markcial/upto
oh-my-fish/plugin-node-binpath
oh-my-fish/plugin-pj
FabioAntunes/fish-nvm
edc/bass
joseluisq/gitnow@2.11.0
paysonwallach/fish-you-should-use
lengyijun/fc-fish
brewingweasel/fishbang
meaningful-ooo/sponge
